In [1]:
import pandas as pd

In [2]:
netflix_file = "netflix_titles.csv"
other_file = "hulu_and_prime_titles.csv"

In [3]:
db_netflix = pd.read_csv(netflix_file)
db_other = pd.read_csv(other_file)

In [4]:
db_other.head()

,Unnamed: 0,ID,Title,Year,Age,IMDb,Rotten Tomatoes,Hulu,Prime Video,Disney+,Type,Directors,Genres,Country,Language,Runtime
0,0,1,Inception,2010,13+,8.8,87%,0,0,0,0,Christopher Nolan,"Action,Adventure,Sci-Fi,Thriller","United States,United Kingdom","English,Japanese,French",148.0
1,1,2,The Matrix,1999,18+,8.7,87%,0,0,0,0,"Lana Wachowski,Lilly Wachowski","Action,Sci-Fi",United States,English,136.0
2,2,3,Avengers: Infinity War,2018,13+,8.5,84%,0,0,0,0,"Anthony Russo,Joe Russo","Action,Adventure,Sci-Fi",United States,English,149.0
3,3,4,Back to the Future,1985,7+,8.5,96%,0,0,0,0,Robert Zemeckis,"Adventure,Comedy,Sci-Fi",United States,English,116.0
4,4,5,"The Good, the Bad and the Ugly",1966,18+,8.8,97%,0,1,0,0,Sergio Leone,Western,"Italy,Spain,West Germany",Italian,161.0

In [5]:
db_netflix = db_netflix.loc[db_netflix['country'].str.contains('United States', na=False)]

In [6]:
db_netflix = db_netflix['title']

In [7]:
db_netflix = db_netflix.reset_index()

In [8]:
db_netflix['Netflix'] = 1

In [9]:
db_netflix = db_netflix[['title','Netflix']]
db_netflix = db_netflix.rename(columns={'title':'Title'})
db_netflix.head()

  Title  Netflix
0     9        1
1    21        1
2   187        1
3  1922        1
4  1983        1

In [10]:
db_hulu = db_other.loc[db_other['Hulu'] == 1]

In [11]:
db_hulu = db_hulu[['Title','Hulu']]
db_hulu = db_hulu.sort_values(by='Title')
db_hulu = db_hulu.reset_index(drop=True)

In [12]:
db_hulu.head()

                        Title  Hulu
0             10.0 Earthquake     1
1                 100 Streets     1
2                       10x10     1
3                  11 Minutes     1
4  12 Dog Days Till Christmas     1

In [13]:
db_primevideo = db_other.loc[db_other['Prime Video'] == 1]

In [14]:
db_primevideo = db_primevideo[['Title','Prime Video']]
db_primevideo = db_primevideo.sort_values(by='Title')
db_primevideo = db_primevideo.reset_index(drop=True)

In [15]:
db_primevideo.head()

                                               Title  Prime Video
0  "22" A film about Veterans, Healthcare and Sui...            1
1                                   #IMomSoHard Live            1
2                                          #LoveSwag            1
3  $100 and a T-Shirt: A Documentary About Zines ...            1
4                                    $elfie Shootout            1

In [16]:
frames = [db_netflix,db_hulu,db_primevideo]
db_master = pd.concat(frames)

In [17]:
print(db_master)
db_master = db_master.fillna(0)

                  Title  Netflix  Hulu  Prime Video
0                     9      1.0   NaN          NaN
1                    21      1.0   NaN          NaN
2                   187      1.0   NaN          NaN
3                  1922      1.0   NaN          NaN
4                  1983      1.0   NaN          NaN
...                 ...      ...   ...          ...
12349            mid90s      NaN   NaN          1.0
12350  uwantme2killhim?      NaN   NaN          1.0
12351      जान तेरे नाम      NaN   NaN          1.0
12352               审死官      NaN   NaN          1.0
12353              워터댄스      NaN   NaN          1.0

[16554 rows x 4 columns]

In [18]:
db_master = db_master.drop_duplicates(subset=['Title'])

In [19]:
db_master = db_master.set_index('Title')

In [20]:
print (db_master)

                  Netflix  Hulu  Prime Video
Title
9                     1.0   0.0          0.0
21                    1.0   0.0          0.0
187                   1.0   0.0          0.0
1922                  1.0   0.0          0.0
1983                  1.0   0.0          0.0
...                   ...   ...          ...
mid90s                0.0   0.0          1.0
uwantme2killhim?      0.0   0.0          1.0
जान तेरे नाम          0.0   0.0          1.0
审死官                   0.0   0.0          1.0
워터댄스                  0.0   0.0          1.0

[16080 rows x 3 columns]

In [21]:
import sqlalchemy

In [22]:
engine = sqlalchemy.create_engine("postgresql://postgres:postgres@localhost/ETL_Project")

In [23]:
con = engine.connect()

In [24]:
print(engine.table_names())

['movies']

In [25]:
db_master.to_sql('movies',con)